/*
Задача 2. Напишете функцията int atof(char *s), която преобразува стринг в число с десетична запетая. 
Тази функция е подобна на разглежданата по-горе atoi(char *s), само че когато се стигне до . точката, 
отделяща цялата част от дробната, трябва да се пусне още един цикъл, който да изчисли числото в 
дробната част по същия начин, както е числото в цялата част. Само че тук при дробната част трябва 
да имаме една променлива, която да умножаваме по 10 всеки път до края на дробната част power *= 10; 
Накрая трябва да разделим полученото число на тази променлива, за да получим реалното число с 
плаващата заперая на точното място.
*/
#include <stdio.h>

double atof(const char *s);

int main(void){
    char s[] = "123675.87786954";
    printf("%lf", atof(s)); 
}

double atof(const char s[]){ 
    int i;
    int counter=0;
    int power = 1;
    double n = 0.00;
    while (s[counter]!='.'){
        counter++;
    }
    for(i = 0; s[i] >= '0' && s[i] <= '9' && s[i]!='.'; i++)
        n = 10 * n + (s[i] - '0');
    
    for (i=counter; s[i]!='\0';i++){
        n = 10 * n + (s[i] - '0');
        power*=10;
    }

    return (n/power);
 }