/*
Задача 7. Напишете заглавен файл с декларации на функции и
сложете гардове. Този начин намалява времето за компилиране на
големи проекти.

#pragma once също ще позволи само веднъж да се добави файла, НО при дадерни ситуации, като добавяне на различни места 
или от различни по име файлове, може да ни подведе.

*/
#include <stdio.h>
#ifndef DEBUG
#define DEBUG 42
#endif

int main(){
    printf("Answer to everything is: %d", DEBUG);
}