/*
Задача 1.Направете глобална константа pi = 3.14, както правихме в предишния 
урок. Напишете функция, която изчислява площта на кръг, на която като параметър
подаваме радиуса и връщаме площта на кръга. Използвайте глобалната константа pi,
за да извършите изчисленията. Извикайте функцията в main() и покажете резултата. 
*/

#include <stdio.h>

const float cPi = 3.14;

float Circle(float radius);
float Menu();

int main()
{
    printf("%.2f", Circle(2.01));
    
}

float Circle (float radius){
    return cPi*radius*radius;
}