/*
Задача 3. Дефинирайте и инициализирайте тримерен масив с по 5 елемента (5 x 5 x 5).
*/

#include <stdio.h>

int main(){
int TheMatrix3D [5] [5] [5] =
    {
        {{1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}},
        {{1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}},
        {{1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}},
        {{1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}},
        {{1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}, {1, 0, 1}},
    };

    for(int i=1;i<5;i++)
	{
		for(int j=1;j<5;j++)
		{
			for(int k=1;k<5;k++)
			{
				printf("%d ",TheMatrix3D[i][j][k]);
				if(k==5)
				{
					printf("\n");
				}
			}
		}
		printf("\n");
	}
}