/*
Задача 1. Напишете програма, която сумира всички елементи на масив намиращи се на четна позиция:
int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
Декларирайте пойнтер към първата нечетна позиция, инкрементирайте пойнтера по подходящ начин, за да извършите 
сумирането.
*/

#include <stdio.h>

int main(){
    int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
    int *pointy = arr+1;
    int sum = 0;
    for (int i=0; i<=5; i++){
        sum += *pointy;
        *pointy++;
        *pointy++;
        printf("%d\n", sum);
    }
    /* BUG: ПОЙНТЕРА СТАВА РАВЕН НА СУМАТА КАТО СТОЙНОСТ
    printf("%d", *pointy);
    */
}