/*
 Задача 7.
Направете програма, в която инициализирате пойнтер към променлива и след това изчислявате сбор на 
променливата (използвайки пойнтера) + 5. Отпечатайте на екрана.
*/

#include <stdio.h>

int main(){
    int *Pointy = NULL;
    int a = 7;
    Pointy = &a;
    *Pointy += 5;

    printf("%d", a);
}