/*
 Задача 5.
Дефинирайте и инициализирайте int променлива = 34 и пойнтер към нея.
Опитайте да ги разместите, като поредност (първо да е пойнтерът, после променливата).

Можете ли да умножите пойнтер по пойнтер? - на теория има начин да се подаде командата, ако сме абсолютно сигурни, какво
ще намерим на адресите на двата пойнтера и сме сигурни, че адресите няма да се проименят. На практика е грешно и
води до неизвестни резултати.

При тази декларация колко пойнтера имаме:
int *p, k; - един пойнтер и една променлива
*/

#include <stdio.h>

int main(){
    int *Pointy = NULL;
    int promenliva = 34;
    Pointy = &promenliva;

    printf("%d", *Pointy);
}