/*
 Задача 8.
Заделяне на памет от стека с alloca. Заделете памет в стека (няма нужда от free())

Фиксирал съм бройката елементи с идеята, че имаме силно лимитиран размер на стека 
(не че с дадения пример можем толкова лесно да го препълним).
Ако обаче ползваме alloca в реална програма можем да си вккараме голям автогол (ПРИМЕР alloca в един header :) )
*/
#include <stdlib.h>
#include <stdio.h>

int main(){
    int *p = alloca(10);
    printf("Pointer *p allocated at %p\n", p);
}